<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Sql</h1>

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<p style="text-align:justify; font-size:25px">Sql (Structured Query Language) is a programming language used for manage and manipulating data in relational databases<br>It allows you to insert, update, retrieve, and delete data in a database<br>It is widely used for data management in many applications, websites, and businesses.<br>In simple terms, SQL is used to communicate eith with and control databases</p>
<br><br>
Types of Sql Commands<br>
<br><img style="display: block;margin-left: auto;margin-right: auto;width: 60%; " src="./sql_images/commands_type.jpg">
</div>

<h1 style="text-align:left; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Data Definition Commands (DDL)</h1>

<br>
<p style="text-align:justify; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">DDL stands for Data Definition Language.<br>It is a subset of SQL (Structured Query Language) that is used to define and manage the structure of a database. DDL commands are responsible for creating, modifying, and deleting database objects</p>

In [58]:
import mysql.connector

db = mysql.connector.connect(
    
    host="localhost",
    port=3307,
    user="root",
    password="",

)

In [59]:
db.connect() # conneted

In [60]:
cursor = db.cursor() # pointer

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Show DataBase
</h3><br>
<h3 style="color:red; font-size:35px;">SHOW DATABASES</h3>

In [125]:
cursor.execute("SHOW DATABASES")

for i in cursor.fetchall():
    print(i)

('DDL',)
('campusx',)
('csv_data',)
('information_schema',)
('login',)
('mydatabase',)
('mydb',)
('mysql',)
('newdb',)
('performance_schema',)
('phpmyadmin',)
('tempdata',)
('test',)
('testing',)

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Create Database
</h3><br>
<h3 style="color:red; font-size:35px;">CREATE DATABASE name IF NOT EXISTS</h3>

In [11]:
cursor.execute("CREATE DATABASE IF NOT EXISTS testdb")

In [19]:
cursor.execute("SHOW DATABASES")

for i in cursor.fetchall():
    print(i)

('DDL',)
('campusx',)
('csv_data',)
('information_schema',)
('login',)
('mydatabase',)
('mydb',)
('mysql',)
('newdb',)
('performance_schema',)
('phpmyadmin',)
('tempdata',)
('test',)
('testdb',)
('testing',)

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Delete Database
</h3><br>
<h3 style="color:red; font-size:35px;">DROP DATABASE name</h3>

In [23]:
cursor.execute("DROP DATABASE testdb")

In [24]:
cursor.execute("SHOW DATABASES")

for i in cursor.fetchall():
    print(i)

('DDL',)
('campusx',)
('csv_data',)
('information_schema',)
('login',)
('mydatabase',)
('mydb',)
('mysql',)
('newdb',)
('performance_schema',)
('phpmyadmin',)
('tempdata',)
('test',)
('testing',)

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Clear Table Values in Database
</h3><br>
<h3 style="color:red; font-size:35px;">TRUNCATE TABLE name</h3>

In [40]:
# first show the tables

cursor.execute("SHOW TABLES FROM DDL")

for i in cursor.fetchall():
    print(i)

('users',)
('users_info',)

In [41]:
# show table values

cursor.execute("SELECT * FROM DDL.users_info")
for i in cursor.fetchall():
    print(i)

('Mubeen@123', 56875)

In [43]:
cursor.execute("TRUNCATE TABLE DDL.users_info")

In [44]:
# check table are exist ?

cursor.execute("SHOW TABLES FROM DDL")

for i in cursor.fetchall():
    print(i)

('users',)
('users_info',)

In [45]:
# show table values again

cursor.execute("SELECT * FROM DDL.users_info")
for i in cursor.fetchall():
    print(i) # values are removed in the table

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:black; font-size:25px;">So Truncate only clear the table they cant delete the table
</h3><br>
</div>

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Delete the table
</h3><br>
<h3 style="color:red; font-size:35px;">DROP TABLE name</h3>

In [49]:
cursor.execute("DROP TABLE DDL.users_info")

In [50]:
# now again check tables user_info are exists

cursor.execute("SHOW TABLES FROM DDL")

for i in cursor.fetchall():
    print(i) # so user_info table are delected

('users',)

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Data Integrity</h1>

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<p style="text-align:justify; font-size:25px">Data integrity in databases refers to the accuracy , compleness and consists of the data stored in a database.<br> it is measures of the reliability and trustworthiness of the data and ensure that the data in a database is protected from errors, corruption, or unauthorized<br><br>There are  various methods used to ensure data integrity
    <ul ><p style="color:Green;">Constrains</p>
        <ol><br>Constraints in databases are rules or conditions that must be met for data to inserted, updated, or deleted in a database table<br><br>They are used to enforce the integrity of the data stored in a database and to prevent data from becoming inconsistent or corrupted </ol></ul>
<ul><p style="color:Green;">Transcations</p><ol><br>
    A Transcations is Sequence of database operations that are treated as a single unit of work
</ol></ul>
    <ul><p style="color:Green;">Normalization</p><ol><br>Normalization is a design technique that minimizes data redundancy and ensures data consistency organizing data into separate tables</ol></ul>
</p>
<br><br>
</div>

<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
First Learn How to Create a Table and Insert Value in the table
</div>

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Create a Table DataBase
</h3><br>
<h3 style="color:red; font-size:35px;">CREATE TABLE name(col_name Type) </h3>

In [65]:
cursor.execute("SHOW TABLES FROM test")
print(cursor.fetchall())
# test database are empty

[]

In [66]:
# now create a Table
cursor.execute("CREATE TABLE test.users(NAME VARCHAR(255))") # VARCHAR(255) is a Str datatype and 255 is a max length

In [67]:
cursor.execute("SHOW TABLES FROM test")
print(cursor.fetchall())
# check again table

[('users',)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Insert Value in a Table
</h3><br>
<h3 style="color:red; font-size:35px;">INSERT INTO name(col_name) VALUES (value) </h3>

In [77]:
cursor.execute("INSERT INTO test.users(NAME) VALUES ('Mubeen')")

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<br>
<h3 style="color:#005bbd; font-size:25px;">Show Table data
</h3><br>
<h3 style="color:red; font-size:35px;">SELECT * FROM name </h3>

In [78]:
cursor.execute("SELECT * FROM test.users")

for i in cursor.fetchall():
    print(i)

('Mubeen',)

In [79]:
# insert multiple values

query = """
INSERT INTO test.users(NAME) VALUES 
('ALI'),
('Imran'),
('Faizan') 
"""

cursor.execute(query)

In [80]:
# check values
cursor.execute("SELECT * FROM test.users")

for i in cursor.fetchall():
    print(i)

('Mubeen',)
('ALI',)
('Imran',)
('Faizan',)

<h1 style="text-align:left; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">NOT NULL</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Not NULL means user cant skip the data</div>

In [83]:
# create a new table

query = """
CREATE TABLE test.users2(

        user_name VARCHAR(255),
        user_id INTEGER NOT NULL
)

"""
cursor.execute(query)

In [84]:
# now fill value
query = """
INSERT INTO test.users2 (user_name,user_id) VALUES

        ('Mubeen',1),
        ('ALi',2)

"""
cursor.execute(query)

In [85]:
# show value
cursor.execute("SELECT * FROM test.users2")

for i in cursor.fetchall():
    print(i)

('Mubeen', 1)
('ALi', 2)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Now try to skip user_id</div>

In [91]:
# now fill value
query = """
INSERT INTO test.users2 (user_name) VALUES

        ('rizwan')

"""
try:
    cursor.execute(query)
except Exception as e:
    print(e)

1364 (HY000): Field 'user_id' doesn't have a default value

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Now try to skip user_name bcz i cant set NOT NULL on user_name</div>

In [93]:
# now fill value
query = """
INSERT INTO test.users2 (user_id) VALUES

        (3),
        (4)

"""
cursor.execute(query)

In [94]:
# check values

cursor.execute("SELECT * FROM test.users2")

for i in cursor.fetchall():
    print(i)

('Mubeen', 1)
('ALi', 2)
(None, 3)
(None, 4)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">in python NULL values are represent with None</div>

<h1 style="text-align:left; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">UNIQUE</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">unique checks the value are cant match with previous data</div>

In [95]:
# create a new table

query = """
CREATE TABLE test.users3(

        user_name VARCHAR(255) UNIQUE,
        user_id INTEGER NOT NULL
)

"""
cursor.execute(query)

In [99]:
# now fill value
query = """
INSERT INTO test.users3 (user_name,user_id) VALUES

        ('mubeen@xyz',1)
"""
cursor.execute(query)

In [100]:
# check values

cursor.execute("SELECT * FROM test.users3")

for i in cursor.fetchall():
    print(i)

('mubeen@xyz', 1)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now try to add same user_name</div>

In [101]:
# now fill value
query = """
INSERT INTO test.users3 (user_name,user_id) VALUES

        ('mubeen@xyz',2)

"""
try:
    cursor.execute(query)
except Exception as e:
    print(e)

1062 (23000): Duplicate entry 'mubeen@xyz' for key 'user_name'

In [102]:
# now insert unique user_name
query = """
INSERT INTO test.users3 (user_name,user_id) VALUES

        ('mubeen123@xyz',1)
"""
cursor.execute(query)

In [103]:
# check values

cursor.execute("SELECT * FROM test.users3")

for i in cursor.fetchall():
    print(i)

('mubeen@xyz', 1)
('mubeen123@xyz', 1)

<h1 style="text-align:left; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">PRIMARY KEY AUTO_INCREMENT</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Auto increment auto change the value  of integer data<br>Auto increment working with primary key<br><br>We Dont Need to use UNIQUE with AUTO INCREMENT</div>

In [104]:
# create a new table

query = """
CREATE TABLE test.users4(

        user_name VARCHAR(255) UNIQUE, 
        user_id INTEGER PRIMARY KEY AUTO_INCREMENT
)

"""
cursor.execute(query)

In [106]:
# now fill value
query = """
INSERT INTO test.users4 (user_name) VALUES
    ('Mubeen'),('Ali'),('Fahad')

"""
cursor.execute(query)

In [108]:
# check values

cursor.execute("SELECT * FROM test.users4")

for i in cursor.fetchall():
    print(i)  # user_id are auto updated

('Ali', 2)
('Fahad', 3)
('Mubeen', 1)

<h1 style="text-align:left; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">DEFAULT</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Default are used for set a Default value if the user can't add a value</div>

In [113]:
# create a new table

query = """
CREATE TABLE test.users6(

        user_name VARCHAR(255) UNIQUE, 
        user_id INTEGER PRIMARY KEY AUTO_INCREMENT,       
        status VARCHAR(255) DEFAULT 'Not provied',
        created_time TIMESTAMP DEFAULT CURRENT_TIMESTAMP 
)

"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">here TIMESTAMP is the data type </div>

In [115]:
# now fill value
query = """
INSERT INTO test.users6 (user_name) VALUES
    ('Mubeen'),('Ali')
"""
cursor.execute(query)

In [116]:
# check values

cursor.execute("SELECT * FROM test.users6")

for i in cursor.fetchall():
    print(i)  # user_id are auto updated

('Mubeen', 1, 'Not provied', datetime.datetime(2023, 12, 18, 1, 22, 9))
('Ali', 2, 'Not provied', datetime.datetime(2023, 12, 18, 1, 22, 9))

In [117]:
# now fill status
query = """
INSERT INTO test.users6 (user_name,status) VALUES
    ('Zain','OK')
"""
cursor.execute(query)

In [118]:
# check values

cursor.execute("SELECT * FROM test.users6")

for i in cursor.fetchall():
    print(i)  # user_id are auto updated

('Mubeen', 1, 'Not provied', datetime.datetime(2023, 12, 18, 1, 22, 9))
('Ali', 2, 'Not provied', datetime.datetime(2023, 12, 18, 1, 22, 9))
('Zain', 3, 'OK', datetime.datetime(2023, 12, 18, 1, 23, 6))

<h1 style="text-align:left; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">CHECK</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Check used to apply a specfic Condition</div>

In [119]:
# create a new table

query = """
CREATE TABLE test.users7(

        user_name VARCHAR(255) UNIQUE,
        age INTEGER CHECK(age > 12)
)

"""
cursor.execute(query)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now age must be greater than 12</div>

In [121]:
query = """
INSERT INTO test.users7 (user_name,age) VALUES

        ('usr1@xyz',12)
"""
try:
    cursor.execute(query)
except Exception as e:
    print(e)

4025 (23000): CONSTRAINT `users7.age` failed for `test`.`users7`

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now try to add age greater than 12</div>

In [122]:
query = """
INSERT INTO test.users7 (user_name,age) VALUES

        ('usr1@xyz',13)
"""
cursor.execute(query)

In [123]:
# check values

cursor.execute("SELECT * FROM test.users7")

for i in cursor.fetchall():
    print(i)

('usr1@xyz', 13)

<hr>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Commands

<ul>SHOW DATABASES</ul>
<ul>SHOW TABLE FROM name</ul>
<ul>CREATE DATABASE IF NOT EXISTS name</ul>
<ul>CREATE DATABASE name</ul>
<ul>DROP DATABASE name</ul>
<ul>DROP TABLE name</ul>
<ul>TRUNCATE TABLE name</ul>
<ul>NOT NULL</ul>
<ul>UNIQUE</ul>
<ul>DEFAULT</ul>
<ul>PRIMARY KEY AUTO_INCREMENT</ul>
<ul>CHECK</ul>
</div>